<a href="https://colab.research.google.com/github/fkihu/Model-Quality-and-Improvement-Assignment/blob/main/Week_5D1_Assignment_Machine_Learning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

For this assignment, we would like to determine which candidates are eligible for a promotion using the available dataset that spans various departments.

In [ ]:
import pandas as pd
# import decision tree from the sklearn library
from sklearn.tree import DecisionTreeClassifier

Reading the data

In [ ]:
df = pd.read_csv('https://bit.ly/2ODZvLCHRDataset')

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

Checking for columns with null values.

In [ ]:
df.isna().sum()

employee_id                0
department                 0
region                     0
education               2409
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    4124
length_of_service          0
KPIs_met >80%              0
awards_won?                0
avg_training_score         0
is_promoted                0
dtype: int64

Checking the size of our dataset

In [ ]:
df.shape

(54808, 14)

Exploring the data (first 5 records)

In [ ]:
df.head()

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

Exploring the data (last 5 records)

In [ ]:
df.tail()

       employee_id         department  ... avg_training_score is_promoted
54803         3030         Technology  ...                 78           0
54804        74592         Operations  ...                 56           0
54805        13918          Analytics  ...                 79           0
54806        13614  Sales & Marketing  ...                 45           0
54807        51526                 HR  ...                 49           0

[5 rows x 14 columns]

Checking if our dataset has duplicates. Finding: There are no duplicates.

In [ ]:
df.duplicated().sum()

0

Defining our task into a classification task. We'll use the avg_training_score as the determining factor of who gets promoted and who doesn't. An additional column (is_promoted1) has been created that categorizes the employees as either 1s or 0s depending on their average training score. Those who score 60% and above are eligible for a promotion (1) and those who score less than 60% aren't eligible.

In [ ]:
df.loc[df['avg_training_score'] >= 60, 'is_promoted1'] = 1
df.loc[df['avg_training_score'] < 60, 'is_promoted1'] = 0

Saving the training dataset in the features and target variables. For this task, we'll drop the features that do not contain float values and keep the rest. This will include the column, 'previous_year_rating' since it has null values as seen from the previous cell. We will also drop the avg_training_score (since we do not need it anymore) as well as is_promoted and is_promoted1.

In [ ]:
features = df.drop(['department', 'region', 'education', 'gender', 'recruitment_channel', 'previous_year_rating', 'avg_training_score','is_promoted', 'is_promoted1'], axis = 1)
target = df[['is_promoted1']]
features.head()
#target.head()

   employee_id  no_of_trainings  ...  KPIs_met >80%  awards_won?
0        65438                1  ...              1            0
1        65141                1  ...              0            0
2         7513                1  ...              0            0
3         2542                2  ...              0            0
4        48945                1  ...              0            0

[5 rows x 6 columns]

Initiating training

In [ ]:

model = DecisionTreeClassifier()

model.fit(features, target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

Testing the model. We create a new dataframe with hypothetical figures, the employee_ids are 100000, 100001,100002 and 100003. The staff 100000 is a control record whose details match employee with id 3030

In [ ]:
new_features = pd.DataFrame(
    [
        [100000, 1, 48, 17, 0, 0],
        [100001, 2, 37, 2, 0, 0],
        [100002, 3, 47, 3, 1, 1],
        [100003, 4, 57, 4, 0, 0],
    ],
    columns=features.columns,
)

new_features

   employee_id  no_of_trainings  ...  KPIs_met >80%  awards_won?
0       100000                1  ...              0            0
1       100001                2  ...              0            0
2       100002                3  ...              1            1
3       100003                4  ...              0            0

[4 rows x 6 columns]

In [ ]:
# predict answers and print the result on the screen
answers = model.predict(new_features)
print(answers)

[1. 1. 0. 1.]

Conclusion: The model has been able to make predictions of who qualifies for a promotion and who doesn't. Looking at the control record, i.e. staff 100000, the prediction was 1, which matches with that of staff 3030. So the model works.

In [ ]:
df.loc[df.employee_id.isin(['3030'])]

       employee_id  department  ... is_promoted is_promoted1
54803         3030  Technology  ...           0          1.0

[1 rows x 15 columns]